In [1]:
import pandas as pd

In [3]:
customers = pd.read_csv('customers_wk9_thurs.csv')

In [5]:
products = pd.read_csv('products_wk9_thurs.csv')

In [7]:
sales = pd.read_csv('sales_wk9_thurs.csv')

In [9]:
customers.head(3)

,customer_id,first_name,last_name,age,state,income,registration_date,email
0,1,John,Smith,34,CA,75000,2022-01-15,john.smith@email.com
1,2,Sarah,Johnson,28,NY,82000,2022-01-22,sarah.johnson@email.com
2,3,Michael,Brown,45,TX,95000,2022-02-03,michael.brown@email.com

In [11]:
products.head(3)

,product_id,product_name,category,price,launch_date,brand
0,1,Wireless Bluetooth Headphones,Electronics,79.99,2021-03-15,AudioTech
1,2,Organic Cotton T-Shirt,Clothing,24.99,2021-04-20,EcoWear
2,3,Stainless Steel Water Bottle,Home & Garden,19.99,2021-05-10,HydroLife

In [13]:
sales.head(3)

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount
0,1,1,1,2022-02-10 14:30:00,1,79.99
1,2,2,3,2022-02-15 10:15:00,2,39.98
2,3,3,5,2022-02-20 16:45:00,1,34.99

In [15]:
#1.1.a #Convert date string columns to datetime objects
customers['registration_date'] = pd.to_datetime(customers['registration_date'])
sales['transaction_date'] = pd.to_datetime(sales['transaction_date'])
products['launch_date'] = pd.to_datetime(products['launch_date'])

In [17]:
#1.1.b Extract year, month, and day of week for sales transactions
sales['sales_year'] = sales['transaction_date'].dt.year
sales['sales_month'] = sales['transaction_date'].dt.month_name()
sales['sales_day'] = sales['transaction_date'].dt.day_name()

In [19]:
sales.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,sales_year,sales_month,sales_day
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,February,Thursday
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,February,Tuesday
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,February,Sunday
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,February,Friday
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,March,Tuesday

In [21]:
#1.1.c Find the date range of our sales data by using min() and max()
min_date = sales['transaction_date'].min()
print('Min_Date:', min_date)
max_date = sales['transaction_date'].max()
print('Max_Date:', max_date)

Min_Date: 2022-02-10 14:30:00
Max_Date: 2024-03-05 10:30:00

In [23]:
# Find the busiest day of the week by counting transactions
# .value_counts() counts occurrences of each unique value
# Count transactions for each day name
# Display all days ranked by transaction count for complete picture
sales['sales_day'].value_counts().head()

sales_day
Friday      24
Tuesday     22
Thursday    21
Sunday      21
Saturday    21
Name: count, dtype: int64

In [25]:
# 1.1.a Get the day with most transactions (first in sorted list)
         # Get the count for that day
sales['sales_day'].value_counts().head(1)

sales_day
Friday    24
Name: count, dtype: int64

In [27]:
#1.2.b Determine which month had the most transactions
sales['sales_month'].value_counts().head()

sales_month
February    16
March       14
December    14
April       12
May         12
Name: count, dtype: int64

In [29]:
#1.3.c Count how many sales happened in each year
sales['sales_year'].value_counts()

sales_year
2023    72
2022    65
2024    13
Name: count, dtype: int64

In [31]:
#Part 2: GroupBy and Aggregation
#Product Analysis:
#2.1a Group products by category and calculate the average price for each category

In [33]:
products.groupby('category')['price'].mean().round(2)

category
Accessories           35.07
Clothing              52.24
Electronics           59.99
Home & Garden         30.16
Sports & Outdoors    105.90
Name: price, dtype: float64

In [35]:
#2.1b Count how many products are in each category

In [37]:
products['category'].value_counts()

category
Electronics          13
Clothing             12
Home & Garden        12
Accessories          12
Sports & Outdoors    11
Name: count, dtype: int64

In [39]:
# Group products by category and calculate average price for each category
# .groupby() splits the data into groups based on the 'category' column
# .mean() calculates the average for each group
# .round(2) rounds to 2 decimal places for currency formatting
# .sort_values(ascending=False) sorts from highest to lowest price
# Loop through each category and its average price             
# Format with dollar sign
# .value_counts() counts occurrences of each unique category

In [41]:
#2.1.a Group customers by state and calculate average age
# This shows us the demographic profile of customers in different regions
customers.groupby('state')['age'].mean().round(1)

state
CA    34.1
FL    39.0
IL    37.2
NY    36.5
TX    38.3
Name: age, dtype: float64

In [43]:
#2.2.b calculate total spending per customer
sales.groupby('customer_id')['total_amount'].sum()

customer_id
1     229.98
2     179.96
3     154.98
4     234.95
5     149.98
       ...
86     34.99
87     83.97
88    109.98
89     29.99
90    139.96
Name: total_amount, Length: 90, dtype: float64

In [45]:
#2.2c Find the customers who have the made the most purchases
sales.groupby('customer_id').size().sort_values(ascending=False)

customer_id
1     2
32    2
34    2
35    2
36    2
     ..
65    1
64    1
63    1
62    1
90    1
Length: 90, dtype: int64

In [47]:
# Find customers with the most purchases (transaction frequency)
# .groupby().size() counts the number of transactions per customer
# This is different from sum() - it counts rows, not values
customer_purchase_counts = sales.groupby('customer_id').size().sort_values(ascending=False)
top_buyer_id = customer_purchase_counts.index[0]       
# Customer ID with most purchases
top_buyer_purchases = customer_purchase_counts.iloc[0]  
# Number of purchases by top customer
print(f"\nCustomer with most purchases: Customer #{top_buyer_id} ({top_buyer_purchases} purchases)")

Customer with most purchases: Customer #1 (2 purchases)

In [49]:
customers.head()

,customer_id,first_name,last_name,age,state,income,registration_date,email
0,1,John,Smith,34,CA,75000,2022-01-15,john.smith@email.com
1,2,Sarah,Johnson,28,NY,82000,2022-01-22,sarah.johnson@email.com
2,3,Michael,Brown,45,TX,95000,2022-02-03,michael.brown@email.com
3,4,Emily,Davis,31,FL,68000,2022-02-14,emily.davis@email.com
4,5,David,Wilson,52,IL,110000,2022-02-28,david.wilson@email.com

In [51]:
#2.3.a Calculate total sales revenue by month

In [53]:
sales.groupby('sales_month')['total_amount'].sum()

sales_month
April         924.77
August        870.74
December     1458.71
February     1669.66
January       864.79
July          930.80
June          986.68
March        1115.77
May          1177.79
November     1022.76
October      1235.80
September    1150.76
Name: total_amount, dtype: float64

In [55]:
#2.3.b Find the average transaction amount by day of the week

In [57]:
sales.groupby('sales_day')['total_amount'].mean().round(2)

sales_day
Friday       100.94
Monday        90.93
Saturday      61.12
Sunday        99.55
Thursday     102.27
Tuesday       74.03
Wednesday     96.07
Name: total_amount, dtype: float64

In [59]:
#2.3.c Determine which product category generates the most total revenue

In [61]:
products.groupby('category')['price'].size().sort_values(ascending=False)

category
Electronics          13
Accessories          12
Clothing             12
Home & Garden        12
Sports & Outdoors    11
Name: price, dtype: int64

In [63]:
#3.1.a Find which state has the most customers

In [65]:
customers['state'].value_counts()

state
CA    20
NY    20
TX    20
FL    20
IL    20
Name: count, dtype: int64

In [67]:
#3.1.b Identify the top 5 customers by total spending

In [69]:
sales.groupby('customer_id')['total_amount'].size().sort_values(ascending=False).head()

customer_id
1     2
32    2
34    2
35    2
36    2
Name: total_amount, dtype: int64

In [71]:
#3.1.c Determine which day of the week has the highest average transaction value

In [73]:
sales.groupby('sales_day')['total_amount'].mean().round(2)

sales_day
Friday       100.94
Monday        90.93
Saturday      61.12
Sunday        99.55
Thursday     102.27
Tuesday       74.03
Wednesday     96.07
Name: total_amount, dtype: float64